app/controllers/comments_controller.rb

	def create
		@comment = @message.comments.create(comment_params)
		@comment.user_id = current_user.id

		if @comment.save
---
INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Offal banjo ramps, fingerstache ugh hammock ethical gastropub. "], ["message_id", 12], ["created_at", "2015-12-18 03:34:40.146838"], ["updated_at", "2015-12-18 03:34:40.146838"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2015-12-18 03:37:16.132223"], ["id", 4]]

	def update
		if @comment.update(comment_params)
---
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?

	def find_message
		@message = Message.find(params[:message_id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 14]]

	def find_comment
		@comment = @message.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 14], ["id", 8]]