app/controllers/messages_controller.rb

	def index
		@messages = Message.all.order("created_at DESC")
---
SELECT "messages".* FROM "messages"  ORDER BY created_at DESC

	def create
		@message = Message.new(message_params)
		if @message.save
---
INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Message with User"], ["description", "aljflajl;fjflasd"], ["user_id", 1], ["created_at", "2015-12-18 01:53:16.589221"], ["updated_at", "2015-12-18 01:53:16.589221"]]

	def update
		if @message.update(message_params)
---
UPDATE "messages" SET "title" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["title", "$100M Game To Decide Winner of Trophy"], ["updated_at", "2015-12-15 03:10:18.642991"], ["id", 6]]

	def destroy
		@message.destroy
---
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 6]]

	def find_message
		@message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 6]]